Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MM_GPM_DFP/1.3.50/atdf/PIC32MM0064GPM064.atdf
         <register caption="" name="CCP4CON2" offset="0x310" rw="RW" size="4">
            <bitfield caption="" mask="0x000000FF" name="ASDG" values="CCP4CON2__ASDG"/>
            <bitfield caption="" mask="0x00001000" name="SSDG" />
            <bitfield caption="" mask="0x00004000" name="ASDGM" values="CCP4CON2__ASDGM"/>
            <bitfield caption="" mask="0x00008000" name="PWMRSEN" vaues="CCP4CON2__PWMRSEN"/>
            <bitfield caption="" mask="0x00070000" name="ICS" values="CCP4CON2__ICS"/>
            <bitfield caption="" mask="0x00180000" name="AUXOUT" />
            <bitfield caption="" mask="0x00C00000" name="ICGSM" />
            <bitfield caption="" mask="0x01000000" name="OCAEN" />
            <bitfield caption="" mask="0x80000000" name="OENSYNC" values="CCP4CON2__OENSYNC"/>
         </register>
         <register caption="" name="CCP5CON2" offset="0x410" rw="RW" size="4">
            <bitfield caption="" mask="0x000000FF" name="ASDG" values="CCP5CON2__ASDG"/>
            <bitfield caption="" mask="0x00001000" name="SSDG" />
            <bitfield caption="" mask="0x00004000" name="ASDGM" values="CCP5CON2__ASDGM"/>
            <bitfield caption="" mask="0x00008000" name="PWMRSEN" vaues="CCP5CON2__PWMRSEN"/>
            <bitfield caption="" mask="0x00070000" name="ICS" values="CCP5CON2__ICS"/>
            <bitfield caption="" mask="0x00180000" name="AUXOUT" />
            <bitfield caption="" mask="0x00C00000" name="ICGSM" />
            <bitfield caption="" mask="0x01000000" name="OCAEN" />
            <bitfield caption="" mask="0x80000000" name="OENSYNC" values="CCP5CON2__OENSYNC"/>
         </register>
         <register caption="" name="CCP6CON2" offset="0x510" rw="RW" size="4">
            <bitfield caption="" mask="0x000000FF" name="ASDG" values="CCP6CON2__ASDG"/>
            <bitfield caption="" mask="0x00001000" name="SSDG" />
            <bitfield caption="" mask="0x00004000" name="ASDGM" values="CCP6CON2__ASDGM"/>
            <bitfield caption="" mask="0x00008000" name="PWMRSEN" vaues="CCP6CON2__PWMRSEN"/>
            <bitfield caption="" mask="0x00070000" name="ICS" values="CCP6CON2__ICS"/>
            <bitfield caption="" mask="0x00180000" name="AUXOUT" />
            <bitfield caption="" mask="0x00C00000" name="ICGSM" />
            <bitfield caption="" mask="0x01000000" name="OCAEN" />
            <bitfield caption="" mask="0x80000000" name="OENSYNC" values="CCP6CON2__OENSYNC"/>
         </register>
         <register caption="" name="CCP7CON2" offset="0x610" rw="RW" size="4">
            <bitfield caption="" mask="0x000000FF" name="ASDG" values="CCP7CON2__ASDG"/>
            <bitfield caption="" mask="0x00001000" name="SSDG" />
            <bitfield caption="" mask="0x00004000" name="ASDGM" values="CCP7CON2__ASDGM"/>
            <bitfield caption="" mask="0x00008000" name="PWMRSEN" vaues="CCP7CON2__PWMRSEN"/>
            <bitfield caption="" mask="0x00070000" name="ICS" values="CCP7CON2__ICS"/>
            <bitfield caption="" mask="0x00180000" name="AUXOUT" />
            <bitfield caption="" mask="0x00C00000" name="ICGSM" />
            <bitfield caption="" mask="0x01000000" name="OCAEN" />
            <bitfield caption="" mask="0x80000000" name="OENSYNC" values="CCP7CON2__OENSYNC"/>
         </register>
         <register caption="" name="CCP8CON2" offset="0x710" rw="RW" size="4">
            <bitfield caption="" mask="0x000000FF" name="ASDG" values="CCP8CON2__ASDG"/>
            <bitfield caption="" mask="0x00001000" name="SSDG" />
            <bitfield caption="" mask="0x00004000" name="ASDGM" values="CCP8CON2__ASDGM"/>
            <bitfield caption="" mask="0x00008000" name="PWMRSEN" vaues="CCP8CON2__PWMRSEN"/>
            <bitfield caption="" mask="0x00070000" name="ICS" values="CCP8CON2__ICS"/>
            <bitfield caption="" mask="0x00180000" name="AUXOUT" />
            <bitfield caption="" mask="0x00C00000" name="ICGSM" />
            <bitfield caption="" mask="0x01000000" name="OCAEN" />
            <bitfield caption="" mask="0x80000000" name="OENSYNC" values="CCP8CON2__OENSYNC"/>
         </register>
         <register caption="" name="CCP9CON2" offset="0x810" rw="RW" size="4">
            <bitfield caption="" mask="0x000000FF" name="ASDG" values="CCP9CON2__ASDG"/>
            <bitfield caption="" mask="0x00001000" name="SSDG" />
            <bitfield caption="" mask="0x00004000" name="ASDGM" values="CCP9CON2__ASDGM"/>
            <bitfield caption="" mask="0x00008000" name="PWMRSEN" vaues="CCP9CON2__PWMRSEN"/>
            <bitfield caption="" mask="0x00070000" name="ICS" values="CCP9CON2__ICS"/>
            <bitfield caption="" mask="0x00180000" name="AUXOUT" />
            <bitfield caption="" mask="0x00C00000" name="ICGSM" />
            <bitfield caption="" mask="0x01000000" name="OCAEN" />
            <bitfield caption="" mask="0x80000000" name="OENSYNC" values="CCP9CON2__OENSYNC"/>
         </register>
         <register caption="" name="CCP1CON3" offset="0x20" rw="RW" size="4">
            <bitfield caption="" mask="0x0000003F" name="DT" />
            <bitfield caption="" mask="0x00030000" name="PSSBDF" />
            <bitfield caption="" mask="0x000C0000" name="PSSACE" values="CCP1CON3__PSSACE"/>
            <bitfield caption="" mask="0x00100000" name="POLBDF" />
            <bitfield caption="" mask="0x00200000" name="POLACE" values="CCP1CON3_POLACE"/>
            <bitfield caption="" mask="0x07000000" name="OUTM" />
            <bitfield caption="" mask="0x70000000" name="OSCNT" />
            <bitfield caption="" mask="0x80000000" name="OETRIG" />
         </register>
         <register caption="" name="CCP2CON3" offset="0x120" rw="RW" size="4">
            <bitfield caption="" mask="0x0000003F" name="DT" />
            <bitfield caption="" mask="0x00030000" name="PSSBDF" />
            <bitfield caption="" mask="0x000C0000" name="PSSACE" values="CCP2CON3__PSSACE"/>
            <bitfield caption="" mask="0x00100000" name="POLBDF" />
            <bitfield caption="" mask="0x00200000" name="POLACE" values="CCP2CON3_POLACE"/>
            <bitfield caption="" mask="0x07000000" name="OUTM" />
            <bitfield caption="" mask="0x70000000" name="OSCNT" />
            <bitfield caption="" mask="0x80000000" name="OETRIG" />
         </register>
         <register caption="" name="CCP3CON3" offset="0x220" rw="RW" size="4">
            <bitfield caption="" mask="0x0000003F" name="DT" />
            <bitfield caption="" mask="0x00030000" name="PSSBDF" />
            <bitfield caption="" mask="0x000C0000" name="PSSACE" values="CCP3CON3__PSSACE"/>
            <bitfield caption="" mask="0x00100000" name="POLBDF" />
            <bitfield caption="" mask="0x00200000" name="POLACE" values="CCP3CON3_POLACE"/>
            <bitfield caption="" mask="0x07000000" name="OUTM" />
            <bitfield caption="" mask="0x70000000" name="OSCNT" />
            <bitfield caption="" mask="0x80000000" name="OETRIG" />
         </register>
         <register caption="" name="CCP4CON3" offset="0x320" rw="RW" size="4">
            <bitfield caption="" mask="0x000C0000" name="PSSACE" values="CCP4CON3__PSSACE"/>
            <bitfield caption="" mask="0x00200000" name="POLACE" values="CCP4CON3_POLACE"/>
            <bitfield caption="" mask="0x70000000" name="OSCNT" />
            <bitfield caption="" mask="0x80000000" name="OETRIG" />
         </register>
         <register caption="" name="CCP5CON3" offset="0x420" rw="RW" size="4">
            <bitfield caption="" mask="0x000C0000" name="PSSACE" values="CCP5CON3__PSSACE"/>
            <bitfield caption="" mask="0x00200000" name="POLACE" values="CCP5CON3_POLACE"/>
            <bitfield caption="" mask="0x70000000" name="OSCNT" />
            <bitfield caption="" mask="0x80000000" name="OETRIG" />
         </register>
         <register caption="" name="CCP6CON3" offset="0x520" rw="RW" size="4">
            <bitfield caption="" mask="0x000C0000" name="PSSACE" values="CCP6CON3__PSSACE"/>
            <bitfield caption="" mask="0x00200000" name="POLACE" values="CCP6CON3_POLACE"/>
            <bitfield caption="" mask="0x70000000" name="OSCNT" />
            <bitfield caption="" mask="0x80000000" name="OETRIG" />
         </register>
