Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MM_GPM_DFP/1.3.50/atdf/PIC32MM0064GPM064.atdf
         <register caption="" name="CCP3TMR" offset="0x240" rw="RW" size="4">
            <bitfield caption="" mask="0x0000FFFF" name="TMRL" />
            <bitfield caption="" mask="0xFFFF0000" name="TMRH" />
         </register>
         <register caption="" name="CCP4TMR" offset="0x340" rw="RW" size="4">
            <bitfield caption="" mask="0x0000FFFF" name="TMRL" />
            <bitfield caption="" mask="0xFFFF0000" name="TMRH" />
         </register>
         <register caption="" name="CCP5TMR" offset="0x440" rw="RW" size="4">
            <bitfield caption="" mask="0x0000FFFF" name="TMRL" />
            <bitfield caption="" mask="0xFFFF0000" name="TMRH" />
         </register>
         <register caption="" name="CCP6TMR" offset="0x540" rw="RW" size="4">
            <bitfield caption="" mask="0x0000FFFF" name="TMRL" />
            <bitfield caption="" mask="0xFFFF0000" name="TMRH" />
         </register>
         <register caption="" name="CCP7TMR" offset="0x640" rw="RW" size="4">
            <bitfield caption="" mask="0x0000FFFF" name="TMRL" />
            <bitfield caption="" mask="0xFFFF0000" name="TMRH" />
         </register>
         <register caption="" name="CCP8TMR" offset="0x740" rw="RW" size="4">
            <bitfield caption="" mask="0x0000FFFF" name="TMRL" />
            <bitfield caption="" mask="0xFFFF0000" name="TMRH" />
         </register>
         <register caption="" name="CCP9TMR" offset="0x840" rw="RW" size="4">
            <bitfield caption="" mask="0x0000FFFF" name="TMRL" />
            <bitfield caption="" mask="0xFFFF0000" name="TMRH" />
         </register>
         <register caption="" name="CCP1PR" offset="0x50" rw="RW" size="4">
            <bitfield caption="" mask="0x0000FFFF" name="PRL" />
            <bitfield caption="" mask="0xFFFF0000" name="PRH" />
         </register>
         <register caption="" name="CCP2PR" offset="0x150" rw="RW" size="4">
            <bitfield caption="" mask="0x0000FFFF" name="PRL" />
            <bitfield caption="" mask="0xFFFF0000" name="PRH" />
         </register>
         <register caption="" name="CCP3PR" offset="0x250" rw="RW" size="4">
            <bitfield caption="" mask="0x0000FFFF" name="PRL" />
            <bitfield caption="" mask="0xFFFF0000" name="PRH" />
         </register>
         <register caption="" name="CCP4PR" offset="0x350" rw="RW" size="4">
            <bitfield caption="" mask="0x0000FFFF" name="PRL" />
            <bitfield caption="" mask="0xFFFF0000" name="PRH" />
         </register>
         <register caption="" name="CCP5PR" offset="0x450" rw="RW" size="4">
            <bitfield caption="" mask="0x0000FFFF" name="PRL" />
            <bitfield caption="" mask="0xFFFF0000" name="PRH" />
         </register>
         <register caption="" name="CCP6PR" offset="0x550" rw="RW" size="4">
            <bitfield caption="" mask="0x0000FFFF" name="PRL" />
            <bitfield caption="" mask="0xFFFF0000" name="PRH" />
         </register>
         <register caption="" name="CCP7PR" offset="0x650" rw="RW" size="4">
            <bitfield caption="" mask="0x0000FFFF" name="PRL" />
            <bitfield caption="" mask="0xFFFF0000" name="PRH" />
         </register>
         <register caption="" name="CCP8PR" offset="0x750" rw="RW" size="4">
            <bitfield caption="" mask="0x0000FFFF" name="PRL" />
            <bitfield caption="" mask="0xFFFF0000" name="PRH" />
         </register>
         <register caption="" name="CCP9PR" offset="0x850" rw="RW" size="4">
            <bitfield caption="" mask="0x0000FFFF" name="PRL" />
            <bitfield caption="" mask="0xFFFF0000" name="PRH" />
         </register>
         <register caption="" name="CCP1RA" offset="0x60" rw="RW" size="4">
            <bitfield caption="" mask="0x0000FFFF" name="CMPA" />
         </register>
         <register caption="" name="CCP2RA" offset="0x160" rw="RW" size="4">
            <bitfield caption="" mask="0x0000FFFF" name="CMPA" />
         </register>
         <register caption="" name="CCP3RA" offset="0x260" rw="RW" size="4">
            <bitfield caption="" mask="0x0000FFFF" name="CMPA" />
         </register>
         <register caption="" name="CCP4RA" offset="0x360" rw="RW" size="4">
            <bitfield caption="" mask="0x0000FFFF" name="CMPA" />
         </register>
         <register caption="" name="CCP5RA" offset="0x460" rw="RW" size="4">
            <bitfield caption="" mask="0x0000FFFF" name="CMPA" />
         </register>
         <register caption="" name="CCP6RA" offset="0x560" rw="RW" size="4">
            <bitfield caption="" mask="0x0000FFFF" name="CMPA" />
         </register>
         <register caption="" name="CCP7RA" offset="0x660" rw="RW" size="4">
            <bitfield caption="" mask="0x0000FFFF" name="CMPA" />
         </register>
         <register caption="" name="CCP8RA" offset="0x760" rw="RW" size="4">
            <bitfield caption="" mask="0x0000FFFF" name="CMPA" />
         </register>
         <register caption="" name="CCP9RA" offset="0x860" rw="RW" size="4">
            <bitfield caption="" mask="0x0000FFFF" name="CMPA" />
         </register>
         <register caption="" name="CCP1RB" offset="0x70" rw="RW" size="4">
            <bitfield caption="" mask="0x0000FFFF" name="CMPB" />
         </register>
         <register caption="" name="CCP2RB" offset="0x170" rw="RW" size="4">
            <bitfield caption="" mask="0x0000FFFF" name="CMPB" />
         </register>
         <register caption="" name="CCP3RB" offset="0x270" rw="RW" size="4">
            <bitfield caption="" mask="0x0000FFFF" name="CMPB" />
         </register>
         <register caption="" name="CCP4RB" offset="0x370" rw="RW" size="4">
            <bitfield caption="" mask="0x0000FFFF" name="CMPB" />
         </register>
         <register caption="" name="CCP5RB" offset="0x470" rw="RW" size="4">
            <bitfield caption="" mask="0x0000FFFF" name="CMPB" />
         </register>
         <register caption="" name="CCP6RB" offset="0x570" rw="RW" size="4">
            <bitfield caption="" mask="0x0000FFFF" name="CMPB" />
         </register>
         <register caption="" name="CCP7RB" offset="0x670" rw="RW" size="4">
            <bitfield caption="" mask="0x0000FFFF" name="CMPB" />
         </register>
