Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MM_GPM_DFP/1.3.50/atdf/PIC32MM0064GPM064.atdf
   <module caption="" id="02922" name="FUSECONFIG" version="">
      <register-group name="FUSECONFIG">
         <register caption="" initval="0xFFFFFFFF" name="FDEVOPT" offset="0x0" rw="RW" size="4">
            <bitfield caption="Secondary Oscillator High Power Enable bit" mask="0x00000008" name="SOSCHP" values="FDEVOPT__SOSCHP" />
            <bitfield caption="Alternate I2C1 Pins Location Enable bit" mask="0x00000010" name="ALTI2C" values="FDEVOPT__ALTI2C" />
            <bitfield caption="USBID pin control" mask="0x00004000" name="FUSBIDIO" values="FDEVOPT__FUSBIDIO" />
            <bitfield caption="VBUS Pin Control" mask="0x00008000" name="FVBUSIO" values="FDEVOPT__FVBUSIO" />
            <bitfield caption="User ID bits" mask="0xFFFF0000" name="USERID" />
         </register>
         <register caption="" initval="0x00000010" name="FICD" offset="0x4" rw="RW" size="4">
            <bitfield caption="JTAG Enable bit" mask="0x00000004" name="JTAGEN" values="FICD__JTAGEN" />
            <bitfield caption="ICE/ICD Communication Channel Selection bits" mask="0x00000018" name="ICS" values="FICD__ICS" />
         </register>
         <register caption="" initval="0xFFFFFFFF" name="FPOR" offset="0x8" rw="RW" size="4">
            <bitfield caption="Brown-out Reset Enable bits" mask="0x00000003" name="BOREN" values="FPOR__BOREN" />
            <bitfield caption="Retention Voltage Regulator Enable bit" mask="0x00000004" name="RETVR" values="FPOR__RETVR" />
            <bitfield caption="Low Power Brown-out Enable bit" mask="0x00000008" name="LPBOREN" values="FPOR__LPBOREN" />
         </register>
         <register caption="" initval="0x000074F3" name="FWDT" offset="0xc" rw="RW" size="4">
            <bitfield caption="Sleep Mode Watchdog Timer Postscale Selection bits" mask="0x0000001F" name="SWDTPS" values="FWDT__SWDTPS" />
            <bitfield caption="Watchdog Timer Window Size bits" mask="0x00000060" name="FWDTWINSZ" values="FWDT__FWDTWINSZ" />
            <bitfield caption="Windowed Watchdog Timer Disable bit" mask="0x00000080" name="WINDIS" values="FWDT__WINDIS" />
            <bitfield caption="Run Mode Watchdog Timer Postscale Selection bits" mask="0x00001F00" name="RWDTPS" values="FWDT__RWDTPS" />
            <bitfield caption="Run Mode Watchdog Timer Clock Source Selection bits" mask="0x00006000" name="RCLKSEL" values="FWDT__RCLKSEL" />
            <bitfield caption="Watchdog Timer Enable bit" mask="0x00008000" name="FWDTEN" values="FWDT__FWDTEN" />
         </register>
         <register caption="" initval="0x0000DFB9" name="FOSCSEL" offset="0x10" rw="RW" size="4">
            <bitfield caption="Oscillator Selection bits" mask="0x00000007" name="FNOSC" values="FOSCSEL__FNOSC" />
            <bitfield caption="System PLL Input Clock Selection bit" mask="0x00000010" name="PLLSRC" values="FOSCSEL__PLLSRC" />
            <bitfield caption="Secondary Oscillator Enable bit" mask="0x00000040" name="SOSCEN" values="FOSCSEL__SOSCEN" />
            <bitfield caption="Two Speed Startup Enable bit" mask="0x00000080" name="IESO" values="FOSCSEL__IESO" />
            <bitfield caption="Primary Oscillator Selection bit" mask="0x00000300" name="POSCMOD" values="FOSCSEL__POSCMOD" />
            <bitfield caption="System Clock on CLKO Pin Enable bit" mask="0x00000400" name="OSCIOFNC" values="FOSCSEL__OSCIOFNC" />
            <bitfield caption="Secondary Oscillator External Clock Enable bit" mask="0x00001000" name="SOSCSEL" values="FOSCSEL__SOSCSEL" />
            <bitfield caption="Clock Switching and Fail-Safe Clock Monitor Enable bits" mask="0x0000C000" name="FCKSM" values="FOSCSEL__FCKSM" />
         </register>
         <register caption="" initval="0xFFFFFFFF" name="FSEC" offset="0x14" rw="RW" size="4">
            <bitfield caption="Code Protection Enable bit" mask="0x80000000" name="CP" values="FSEC__CP" />
         </register>
      </register-group>
      <value-group caption="Secondary Oscillator High Power Enable bit" name="FDEVOPT__SOSCHP">
         <value caption="SOSC oprerates in high power mode" name="ON" value="0x0" />
         <value caption="SOSC oprerates in normal power mode." name="OFF" value="0x1" />
      </value-group>
      <value-group caption="Alternate I2C1 Pins Location Enable bit" name="FDEVOPT__ALTI2C">
         <value caption="Alternate I2C1 pins are used" name="ON" value="0x0" />
         <value caption="Primary I2C1 pins are used" name="OFF" value="0x1" />
      </value-group>
      <value-group caption="USBID pin control" name="FDEVOPT__FUSBIDIO">
         <value caption="USBID pin is controlled by the port function" name="ON" value="0x0" />
         <value caption="USBID pin is controlled by the USB module" name="OFF" value="0x1" />
      </value-group>
      <value-group caption="VBUS Pin Control" name="FDEVOPT__FVBUSIO">
         <value caption="VBUS pin is controlled by port function" name="ON" value="0x0" />
         <value caption="VBUS pin is controlled by the USB module" name="OFF" value="0x1" />
      </value-group>
      <value-group caption="Background Debugger Enable bits" name="FICD__DEBUG">
         <value caption="Background debugger is enabled" name="ON" value="0x0" />
         <value caption="Background debugger is disabled" name="OFF" value="0x2" />
      </value-group>
      <value-group caption="JTAG Enable bit" name="FICD__JTAGEN">
         <value caption="JTAG is enabled" name="ON" value="0x1" />
         <value caption="JTAG is disabled" name="OFF" value="0x0" />
      </value-group>
      <value-group caption="ICE/ICD Communication Channel Selection bits" name="FICD__ICS">
         <value caption="Communicate on PGEC1/PGED1" name="PGx1" value="0x3" />
         <value caption="Communicate on PGEC2/PGED2" name="PGx2" value="0x2" />
         <value caption="Communicate on PGEC3/PGED3" name="PGx3" value="0x1" />
         <value caption="Not connected" name="NONE" value="0x0" />
      </value-group>
      <value-group caption="Brown-out Reset Enable bits" name="FPOR__BOREN">
         <value caption="Brown-out Reset enabled in hardware; SBOREN bit disabled" name="BOR3" value="0x3" />
         <value caption="Brown-out Reset enabled only while device active and disabled in Sleep; SBOREN bit disabled" name="BOR2" value="0x2" />
         <value caption="Brown-out Reset controlled with the SBOREN bit setting" name="BOR1" value="0x1" />
         <value caption="Brown-out Reset disabled in hardware; SBOREN bit disabled" name="BOR0" value="0x0" />
      </value-group>
      <value-group caption="Retention Voltage Regulator Enable bit" name="FPOR__RETVR">
         <value caption="Retention regulator is enabled and controlled by RETEN bit during sleep" name="ON" value="0x0" />
         <value caption="Retention regulator is disabled" name="OFF" value="0x1" />
      </value-group>
      <value-group caption="Low Power Brown-out Enable bit" name="FPOR__LPBOREN">
         <value caption="Low power BOR is enabled, when main BOR is disabled" name="ON" value="0x1" />
         <value caption="Low power BOR is disabled" name="OFF" value="0x0" />
      </value-group>
      <value-group caption="Sleep Mode Watchdog Timer Postscale Selection bits" name="FWDT__SWDTPS">
         <value caption="1:1" name="PS1" value="0x0" />
         <value caption="1:2" name="PS2" value="0x1" />
         <value caption="1:4" name="PS4" value="0x2" />
         <value caption="1:8" name="PS8" value="0x3" />
         <value caption="1:16" name="PS16" value="0x4" />
         <value caption="1:32" name="PS32" value="0x5" />
         <value caption="1:64" name="PS64" value="0x6" />
         <value caption="1:128" name="PS128" value="0x7" />
         <value caption="1:256" name="PS256" value="0x8" />
         <value caption="1:512" name="PS512" value="0x9" />
         <value caption="1:1024" name="PS1024" value="0xa" />
         <value caption="1:2048" name="PS2048" value="0xb" />
         <value caption="1:4096" name="PS4096" value="0xc" />
         <value caption="1:8192" name="PS8192" value="0xd" />
         <value caption="1:16384" name="PS16384" value="0xe" />
         <value caption="1:32768" name="PS32768" value="0xf" />
         <value caption="1:65536" name="PS65536" value="0x10" />
         <value caption="1:131072" name="PS131072" value="0x11" />
         <value caption="1:262144" name="PS262144" value="0x12" />
         <value caption="1:524288" name="PS524288" value="0x13" />
         <value caption="1:1048576" name="PS1048576" value="0x14" />
      </value-group>
      <value-group caption="Watchdog Timer Window Size bits" name="FWDT__FWDTWINSZ">
         <value caption="Watchdog timer window size is 75%" name="PS75_0" value="0x0" />
         <value caption="Watchdog timer window size is 50%" name="PS50_0" value="0x1" />
         <value caption="Watchdog timer window size is 37.5%" name="PS37_5" value="0x2" />
         <value caption="Watchdog timer window size is 25%" name="PS25_0" value="0x3" />
      </value-group>
      <value-group caption="Windowed Watchdog Timer Disable bit" name="FWDT__WINDIS">
         <value caption="Watchdog timer is in window mode" name="ON" value="0x0" />
         <value caption="Watchdog timer is in non-window mode" name="OFF" value="0x1" />
      </value-group>
      <value-group caption="Run Mode Watchdog Timer Postscale Selection bits" name="FWDT__RWDTPS">
         <value caption="1:1" name="PS1" value="0x0" />
         <value caption="1:2" name="PS2" value="0x1" />
         <value caption="1:4" name="PS4" value="0x2" />
         <value caption="1:8" name="PS8" value="0x3" />
         <value caption="1:16" name="PS16" value="0x4" />
         <value caption="1:32" name="PS32" value="0x5" />
         <value caption="1:64" name="PS64" value="0x6" />
         <value caption="1:128" name="PS128" value="0x7" />
         <value caption="1:256" name="PS256" value="0x8" />
         <value caption="1:512" name="PS512" value="0x9" />
         <value caption="1:1024" name="PS1024" value="0xa" />
         <value caption="1:2048" name="PS2048" value="0xb" />
         <value caption="1:4096" name="PS4096" value="0xc" />
         <value caption="1:8192" name="PS8192" value="0xd" />
         <value caption="1:16384" name="PS16384" value="0xe" />
         <value caption="1:32768" name="PS32768" value="0xf" />
         <value caption="1:65536" name="PS65536" value="0x10" />
         <value caption="1:131072" name="PS131072" value="0x11" />
         <value caption="1:262144" name="PS262144" value="0x12" />
         <value caption="1:524288" name="PS524288" value="0x13" />
         <value caption="1:1048576" name="PS1048576" value="0x14" />
      </value-group>
