Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MM_GPM_DFP/1.3.50/atdf/PIC32MM0064GPM064.atdf
         <register caption="" name="SR0A" offset="0x360" rw="RW" size="4" />
         <register caption="" name="SR1A" offset="0x370" rw="RW" size="4" />
         <register caption="" name="ANSELB" offset="0x3a0" rw="RW" size="4">
            <bitfield caption="" mask="0x00000001" name="ANSB0" />
            <bitfield caption="" mask="0x00000002" name="ANSB1" />
            <bitfield caption="" mask="0x00000004" name="ANSB2" />
            <bitfield caption="" mask="0x00000008" name="ANSB3" />
            <bitfield caption="" mask="0x00000010" name="ANSB4" />
            <bitfield caption="" mask="0x00002000" name="ANSB13" />
            <bitfield caption="" mask="0x00004000" name="ANSB14" />
            <bitfield caption="" mask="0x00008000" name="ANSB15" />
         </register>
         <register caption="" name="TRISB" offset="0x3b0" rw="RW" size="4">
            <bitfield caption="" mask="0x00000001" name="TRISB0" />
            <bitfield caption="" mask="0x00000002" name="TRISB1" />
            <bitfield caption="" mask="0x00000004" name="TRISB2" />
            <bitfield caption="" mask="0x00000008" name="TRISB3" />
            <bitfield caption="" mask="0x00000010" name="TRISB4" />
            <bitfield caption="" mask="0x00000020" name="TRISB5" />
            <bitfield caption="" mask="0x00000040" name="TRISB6" />
            <bitfield caption="" mask="0x00000080" name="TRISB7" />
            <bitfield caption="" mask="0x00000100" name="TRISB8" />
            <bitfield caption="" mask="0x00000200" name="TRISB9" />
            <bitfield caption="" mask="0x00000400" name="TRISB10" />
            <bitfield caption="" mask="0x00000800" name="TRISB11" />
            <bitfield caption="" mask="0x00002000" name="TRISB13" />
            <bitfield caption="" mask="0x00004000" name="TRISB14" />
            <bitfield caption="" mask="0x00008000" name="TRISB15" />
         </register>
         <register caption="" name="PORTB" offset="0x3c0" rw="RW" size="4">
            <bitfield caption="" mask="0x00000001" name="RB0" />
            <bitfield caption="" mask="0x00000002" name="RB1" />
            <bitfield caption="" mask="0x00000004" name="RB2" />
            <bitfield caption="" mask="0x00000008" name="RB3" />
            <bitfield caption="" mask="0x00000010" name="RB4" />
            <bitfield caption="" mask="0x00000020" name="RB5" />
            <bitfield caption="" mask="0x00000040" name="RB6" />
            <bitfield caption="" mask="0x00000080" name="RB7" />
            <bitfield caption="" mask="0x00000100" name="RB8" />
            <bitfield caption="" mask="0x00000200" name="RB9" />
            <bitfield caption="" mask="0x00000400" name="RB10" />
            <bitfield caption="" mask="0x00000800" name="RB11" />
            <bitfield caption="" mask="0x00002000" name="RB13" />
            <bitfield caption="" mask="0x00004000" name="RB14" />
            <bitfield caption="" mask="0x00008000" name="RB15" />
         </register>
         <register caption="" name="LATB" offset="0x3d0" rw="RW" size="4">
            <bitfield caption="" mask="0x00000001" name="LATB0" />
            <bitfield caption="" mask="0x00000002" name="LATB1" />
            <bitfield caption="" mask="0x00000004" name="LATB2" />
            <bitfield caption="" mask="0x00000008" name="LATB3" />
            <bitfield caption="" mask="0x00000010" name="LATB4" />
            <bitfield caption="" mask="0x00000020" name="LATB5" />
            <bitfield caption="" mask="0x00000040" name="LATB6" />
            <bitfield caption="" mask="0x00000080" name="LATB7" />
            <bitfield caption="" mask="0x00000100" name="LATB8" />
            <bitfield caption="" mask="0x00000200" name="LATB9" />
            <bitfield caption="" mask="0x00000400" name="LATB10" />
            <bitfield caption="" mask="0x00000800" name="LATB11" />
            <bitfield caption="" mask="0x00002000" name="LATB13" />
            <bitfield caption="" mask="0x00004000" name="LATB14" />
            <bitfield caption="" mask="0x00008000" name="LATB15" />
         </register>
         <register caption="" name="ODCB" offset="0x3e0" rw="RW" size="4">
            <bitfield caption="" mask="0x00000001" name="ODCB0" />
            <bitfield caption="" mask="0x00000002" name="ODCB1" />
            <bitfield caption="" mask="0x00000004" name="ODCB2" />
            <bitfield caption="" mask="0x00000008" name="ODCB3" />
            <bitfield caption="" mask="0x00000010" name="ODCB4" />
            <bitfield caption="" mask="0x00000020" name="ODCB5" />
            <bitfield caption="" mask="0x00000040" name="ODCB6" />
            <bitfield caption="" mask="0x00000080" name="ODCB7" />
            <bitfield caption="" mask="0x00000100" name="ODCB8" />
            <bitfield caption="" mask="0x00000200" name="ODCB9" />
            <bitfield caption="" mask="0x00000400" name="ODCB10" />
            <bitfield caption="" mask="0x00000800" name="ODCB11" />
            <bitfield caption="" mask="0x00002000" name="ODCB13" />
            <bitfield caption="" mask="0x00004000" name="ODCB14" />
            <bitfield caption="" mask="0x00008000" name="ODCB15" />
         </register>
         <register caption="" name="CNPUB" offset="0x3f0" rw="RW" size="4">
            <bitfield caption="" mask="0x00000001" name="CNPUB0" />
            <bitfield caption="" mask="0x00000002" name="CNPUB1" />
            <bitfield caption="" mask="0x00000004" name="CNPUB2" />
            <bitfield caption="" mask="0x00000008" name="CNPUB3" />
            <bitfield caption="" mask="0x00000010" name="CNPUB4" />
            <bitfield caption="" mask="0x00000020" name="CNPUB5" />
            <bitfield caption="" mask="0x00000040" name="CNPUB6" />
            <bitfield caption="" mask="0x00000080" name="CNPUB7" />
            <bitfield caption="" mask="0x00000100" name="CNPUB8" />
            <bitfield caption="" mask="0x00000200" name="CNPUB9" />
            <bitfield caption="" mask="0x00000400" name="CNPUB10" />
            <bitfield caption="" mask="0x00000800" name="CNPUB11" />
            <bitfield caption="" mask="0x00002000" name="CNPUB13" />
            <bitfield caption="" mask="0x00004000" name="CNPUB14" />
            <bitfield caption="" mask="0x00008000" name="CNPUB15" />
         </register>
         <register caption="" name="CNPDB" offset="0x400" rw="RW" size="4">
            <bitfield caption="" mask="0x00000001" name="CNPDB0" />
            <bitfield caption="" mask="0x00000002" name="CNPDB1" />
            <bitfield caption="" mask="0x00000004" name="CNPDB2" />
            <bitfield caption="" mask="0x00000008" name="CNPDB3" />
            <bitfield caption="" mask="0x00000010" name="CNPDB4" />
            <bitfield caption="" mask="0x00000020" name="CNPDB5" />
            <bitfield caption="" mask="0x00000040" name="CNPDB6" />
            <bitfield caption="" mask="0x00000080" name="CNPDB7" />
            <bitfield caption="" mask="0x00000100" name="CNPDB8" />
            <bitfield caption="" mask="0x00000200" name="CNPDB9" />
            <bitfield caption="" mask="0x00000400" name="CNPDB10" />
            <bitfield caption="" mask="0x00000800" name="CNPDB11" />
            <bitfield caption="" mask="0x00002000" name="CNPDB13" />
            <bitfield caption="" mask="0x00004000" name="CNPDB14" />
            <bitfield caption="" mask="0x00008000" name="CNPDB15" />
         </register>
         <register caption="" name="CNCONB" offset="0x410" rw="RW" size="4">
            <bitfield caption="" mask="0x00000400" name="PORT32" />
            <bitfield caption="" mask="0x00000800" name="CNSTYLE" />
            <bitfield caption="" mask="0x00008000" name="ON" />
         </register>
