Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MM_GPM_DFP/1.3.50/atdf/PIC32MM0064GPM064.atdf
         <register caption="" name="ODCD" offset="0x5e0" rw="RW" size="4">
            <bitfield caption="" mask="0x00000001" name="ODCD0" />
            <bitfield caption="" mask="0x00000002" name="ODCD1" />
            <bitfield caption="" mask="0x00000004" name="ODCD2" />
            <bitfield caption="" mask="0x00000008" name="ODCD3" />
            <bitfield caption="" mask="0x00000010" name="ODCD4" />
         </register>
         <register caption="" name="CNPUD" offset="0x5f0" rw="RW" size="4">
            <bitfield caption="" mask="0x00000001" name="CNPUD0" />
            <bitfield caption="" mask="0x00000002" name="CNPUD1" />
            <bitfield caption="" mask="0x00000004" name="CNPUD2" />
            <bitfield caption="" mask="0x00000008" name="CNPUD3" />
            <bitfield caption="" mask="0x00000010" name="CNPU4" />
         </register>
         <register caption="" name="CNPDD" offset="0x600" rw="RW" size="4">
            <bitfield caption="" mask="0x00000001" name="CNPDD0" />
            <bitfield caption="" mask="0x00000002" name="CNPDD1" />
            <bitfield caption="" mask="0x00000004" name="CNPDD2" />
            <bitfield caption="" mask="0x00000008" name="CNPDD3" />
            <bitfield caption="" mask="0x00000010" name="CNPDD4" />
         </register>
         <register caption="" name="CNCOND" offset="0x610" rw="RW" size="4">
            <bitfield caption="" mask="0x00000400" name="PORT32" />
            <bitfield caption="" mask="0x00000800" name="CNSTYLE" />
            <bitfield caption="" mask="0x00008000" name="ON" />
         </register>
         <register caption="" name="CNEN0D" offset="0x620" rw="RW" size="4">
            <bitfield caption="" mask="0x00000001" name="CNIE0D0" />
            <bitfield caption="" mask="0x00000002" name="CNIE0D1" />
            <bitfield caption="" mask="0x00000004" name="CNIE0D2" />
            <bitfield caption="" mask="0x00000008" name="CNIE0D3" />
            <bitfield caption="" mask="0x00000010" name="CNIE0D4" />
         </register>
         <register caption="" name="CNSTATD" offset="0x630" rw="RW" size="4">
            <bitfield caption="" mask="0x00000001" name="CNSTATD0" />
            <bitfield caption="" mask="0x00000002" name="CNSTATD1" />
            <bitfield caption="" mask="0x00000004" name="CNSTATD2" />
            <bitfield caption="" mask="0x00000008" name="CNSTATD3" />
            <bitfield caption="" mask="0x00000010" name="CNSTATD4" />
         </register>
         <register caption="" name="CNEN1D" offset="0x640" rw="RW" size="4">
            <bitfield caption="" mask="0x00000001" name="CNIE1D0" />
            <bitfield caption="" mask="0x00000002" name="CNIE1D1" />
            <bitfield caption="" mask="0x00000004" name="CNIE1D2" />
            <bitfield caption="" mask="0x00000008" name="CNIE1D3" />
            <bitfield caption="" mask="0x00000010" name="CNIE1D4" />
         </register>
         <register caption="" name="CNFD" offset="0x650" rw="RW" size="4">
            <bitfield caption="" mask="0x00000001" name="CNFD0" />
            <bitfield caption="" mask="0x00000002" name="CNFD1" />
            <bitfield caption="" mask="0x00000004" name="CNFD2" />
            <bitfield caption="" mask="0x00000008" name="CNFD3" />
            <bitfield caption="" mask="0x00000010" name="CNFD4" />
         </register>
         <register caption="" name="SR0D" offset="0x660" rw="R" size="4" />
         <register caption="" name="SR1D" offset="0x670" rw="R" size="4" />
      </register-group>
   </module>
   <module caption="" id="02511" name="HLVD" version="">
      <register-group name="HLVD">
         <register caption="High/Low-Voltage Detect Control Register" name="HLVDCON" offset="0x0" rw="RW" size="4">
            <bitfield caption="High/Low-Voltage Detection Limit Select bits" mask="0x0000000F" name="HLVDL" values="HLVDCON__HLVDL" />
            <bitfield caption="High/Low-Voltage Detection Event Status bit" mask="0x00000100" name="HLVDET" values="HLVDCON__HLVDET" />
            <bitfield caption="Internal Reference Voltage Stable Status bit" mask="0x00000200" name="IRVST" values="HLVDCON__IRVST" />
            <bitfield caption="Band Gap Reference Voltages Stable Status bit" mask="0x00000400" name="BGVST" values="HLVDCON__BGVST" />
            <bitfield caption="Voltage Change Direction Select bit" mask="0x00000800" name="VDIR" values="HLVDCON__VDIR" />
            <bitfield caption="" mask="0x00002000" name="SIDL" />
            <bitfield caption="HLVD Module Enable bit" mask="0x00008000" name="ON" values="HLVDCON__ON" />
         </register>
      </register-group>
      <value-group caption="High/Low-Voltage Detection Limit Select bits" name="HLVDCON__HLVDL">
         <value caption="External LVDIN pin" name="" value="0xf" />
         <value caption="VDD trip point is between 2.00V and 2.22V" name="" value="0xe" />
         <value caption="VDD trip point is between 2.08V and 2.33V" name="" value="0xd" />
         <value caption="VDD trip point is between 2.15V and 2.44V" name="" value="0xc" />
         <value caption="VDD trip point is between 2.25V and 2.55V" name="" value="0xb" />
         <value caption="VDD trip point is between 2.35V and 2.69V" name="" value="0xa" />
         <value caption="VDD trip point is between 2.45V and 2.80V" name="" value="0x9" />
         <value caption="VDD trip point is between 2.65V and 2.98V" name="" value="0x8" />
         <value caption="VDD trip point is between 2.75V and 3.09V" name="" value="0x7" />
         <value caption="VDD trip point is between 2.95V and 3.30V" name="" value="0x6" />
         <value caption="VDD trip point is between 3.25V and 3.63V" name="" value="0x5" />
         <value caption="Reserved; do not use" name="" value="0x4" />
         <value caption="Reserved; do not use" name="" value="0x3" />
         <value caption="Reserved; do not use" name="" value="0x2" />
         <value caption="Reserved; do not use" name="" value="0x1" />
         <value caption="Reserved; do not use" name="" value="0x0" />
      </value-group>
      <value-group caption="High/Low-Voltage Detection Event Status bit" name="HLVDCON__HLVDET">
         <value caption="Indicates HLVD Event interrupt is active" name="" value="0x1" />
         <value caption="Indicates HLVD Event interrupt is not active" name="" value="0x0" />
      </value-group>
      <value-group caption="Internal Reference Voltage Stable Status bit" name="HLVDCON__IRVST">
         <value caption="Indicates internal reference voltage references is stable" name="" value="0x1" />
         <value caption="Indicates internal reference voltage reference is not stable" name="" value="0x0" />
      </value-group>
