Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MM_GPM_DFP/1.3.50/atdf/PIC32MM0064GPM064.atdf
      <value-group caption="USB Sleep Entry Guard bit" name="U1PWRC__USLPGRD">
         <value caption="Sleep entry is blocked if USB bus activity is detected or if a notification is pending" name="" value="0x1" />
         <value caption="USB module does not block Sleep entry" name="" value="0x0" />
      </value-group>
      <value-group caption="USB Activity Pending bit" name="U1PWRC__UACTPND">
         <value caption="USB hardware has detected a change in link status; however" name="" value="0x1" />
         <value caption="An interrupt is not pending" name="" value="0x0" />
      </value-group>
      <value-group caption="(Device mode) USB Reset Interrupt bit Device mode / (Host mode)USB Detach Interrupt bit Host mode" name="U1IR__URSTIF_DETACHIF">
         <value caption="(Device mode)Valid USB Reset has occurred / (Host mode)Peripheral detachment was detected by the USB module" name="" value="0x1" />
         <value caption="(Device mode)o USB Reset has occurred / (Host mode)Peripheral detachment was not detected" name="" value="0x0" />
      </value-group>
      <value-group caption="USB Error Condition Interrupt bit" name="U1IR__UERRIF">
         <value caption="Unmasked error condition has occurred" name="" value="0x1" />
         <value caption="Unmasked error condition has not occurred" name="" value="0x0" />
      </value-group>
      <value-group caption="SOF Token Interrupt bit" name="U1IR__SOFIF">
         <value caption="SOF token received by the peripheral or the SOF threshold reached by the host" name="" value="0x1" />
         <value caption="SOF token was not received nor threshold reached" name="" value="0x0" />
      </value-group>
      <value-group caption="Token Processing Complete Interrupt bit" name="U1IR__TRNIF">
         <value caption="Processing of current token is complete; a read of the UxSTAT register will provide endpoint information" name="" value="0x1" />
         <value caption="Processing of current token not complete" name="" value="0x0" />
      </value-group>
      <value-group caption="Idle Detect Interrupt bit" name="U1IR__IDLEIF">
         <value caption="Idle condition detected (constant Idle state of 3 ms or more)" name="" value="0x1" />
         <value caption="No Idle condition detected" name="" value="0x0" />
      </value-group>
      <value-group caption="Resume Interrupt bit" name="U1IR__RESUMEIF">
         <value caption="K-State is observed on the D+ or D- pin for 2.5 s" name="" value="0x1" />
         <value caption="K-State is not observed" name="" value="0x0" />
      </value-group>
      <value-group caption="Peripheral Attach Interrupt bit" name="U1IR__ATTACHIF">
         <value caption="Peripheral attachment was detected by the USB module" name="" value="0x1" />
         <value caption="Peripheral attachment was not detected" name="" value="0x0" />
      </value-group>
      <value-group caption="STALL Handshake Interrupt bit" name="U1IR__STALLIF">
         <value caption="In Host mode" name="" value="0x1" />
         <value caption="STALL handshake has not been sent" name="" value="0x0" />
      </value-group>
      <value-group caption="(Device mode) USB Reset Interrupt Enable bit Device mode / (Host mode)USB Detach Interrupt Enable bit Host Mode" name="U1IE__URSTIE_DETACHIE">
         <value caption="(Device mode) URSTIF interrupt is enabled / (Host mode) DATTCHIF interrupt is enabled" name="" value="0x1" />
         <value caption="(Device mode) URSTIF interrupt is disabled / (Host mode) DATTCHIF interrupt is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="USB Error Interrupt Enable bit" name="U1IE__UERRIE">
         <value caption="USB Error interrupt is enabled" name="" value="0x1" />
         <value caption="USB Error interrupt is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="SOF Token Interrupt Enable bit" name="U1IE__SOFIE">
         <value caption="SOFIF interrupt is enabled" name="" value="0x1" />
         <value caption="SOFIF interrupt is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Token Processing Complete Interrupt Enable bit" name="U1IE__TRNIE">
         <value caption="TRNIF interrupt is enabled" name="" value="0x1" />
         <value caption="TRNIF interrupt is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Idle Detect Interrupt Enable bit" name="U1IE__IDLEIE">
         <value caption="Idle interrupt is enabled" name="" value="0x1" />
         <value caption="Idle interrupt is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="RESUME Interrupt Enable bit" name="U1IE__RESUMEIE">
         <value caption="RESUME interrupt is enabled" name="" value="0x1" />
         <value caption="RESUME interrupt is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="ATTACH Interrupt Enable bit" name="U1IE__ATTACHIE">
         <value caption="ATTACH interrupt is enabled" name="" value="0x1" />
         <value caption="ATTACH interrupt is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="STALL Handshake Interrupt Enable bit" name="U1IE__STALLIE">
         <value caption="STALL interrupt is enabled" name="" value="0x1" />
         <value caption="STALL interrupt is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="PID Check Failure Flag bit" name="U1EIR__PIDEF">
         <value caption="PID check failed" name="" value="0x1" />
         <value caption="PID check passed" name="" value="0x0" />
      </value-group>
      <value-group caption="(Device mode)CRC5 Host Error Flag bit / (Host mode)EOF Error Flag bit" name="U1EIR__CRC5EF_EOFEF">
         <value caption="(Device mode)Token packet rejected due to CRC5 error / (Host mode)EOF error condition detected" name="" value="0x1" />
         <value caption="(Device mode)Token packet accepted / (Host mode)No EOF error condition" name="" value="0x0" />
      </value-group>
